app/controllers/comentarios_controller.rb

  def create
    @comentario = Comentario.new(comentario_params)
    @post = Post.find(params[:post_id])
    #@comentario = @post.comentarios.create!(params[:comentario])
    @comentario.post = @post

    respond_to do |format|
      if @comentario.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comentarios" ("autor", "corpo", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["autor", "Anonimo"], ["corpo", "eita"], ["post_id", 1], ["created_at", "2016-02-12 20:34:05.404210"], ["updated_at", "2016-02-12 20:34:05.404210"]]