app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.autor = current_user.nome_completo
    @post.usuario = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("titulo", "corpo", "autor", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["titulo", "Teste"], ["corpo", "Post numero 1"], ["autor", "Rafael Fiori Kruger"], ["usuario_id", 4], ["created_at", "2016-02-12 17:01:30.801685"], ["updated_at", "2016-02-12 17:01:30.801685"]]