app/controllers/session_controller.rb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."email" = ? LIMIT 1  [["email", "a@gmail.com"]]
---
  def create
    @usuario = Usuario.find_by(email: params[:session][:email].downcase)