app/controllers/usuarios_controller.rb

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 0]]

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @usuario = Usuario.new(usuario_params)
    @usuario.data_cadastro = Date.current
    @usuario.adm = false
    #@usuario.provider = 'core'

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("nome_completo", "apelido", "sexo", "email", "password_digest", "data_cadastro", "adm", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @usuario = Usuario.find(params[:id])
      if @usuario.update_attributes(usuario_params)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "usuarios" SET "password_digest" = ?, "adm" = ?, "data_cadastro" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["password_digest", "$2a$10$msl887w6ryUdttKRiDFe1.pkao6cyPqwN6Nnnxk1BcUKPVVRviqbS"], ["adm", "t"], ["data_cadastro", "2016-01-12"], ["updated_at", "2016-02-12 19:50:54.850693"], ["id", 7]]

  def permissao_admin
    @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 4]]

  def revogar_admin
    @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 4]]

  def destroy
    @usuario = Usuario.find(params[:id])
    @usuario.destroy
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]